# EA_DataAccCompAdd

## Description
Adds object component.

```pascal
PROCEDURE EA_DataAccCompAdd(
				acc       : INTEGER;
				include   : BOOLEAN;
				lambdaVal : REAL;
				thickness : REAL);
```

```python

def vs.EA_DataAccCompAdd(acc, include, lambdaVal, thickness):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|acc|INTEGER||
|include|BOOLEAN||
|lambdaVal|REAL||
|thickness|REAL||

## Version
Availability: from Vectorworks 2016
## Category
* EnergyAnalysis Interface Library